Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ولو علم الله فيهم خيرا لأسمعهم ولو أسمعهم لتولوا وهم معرضون
en: Had Allah known of any good in them, He would indeed have made them listen; and even if He had made them listen, they would but have turned away with aversion (to the truth).

source: يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم واعلموا أن الله يحول بين المرء وقلبه وأنه إليه تحشرون
en: O you who believe! Answer Allah (by obeying Him) and (His) Messenger when he (صلى الله عليه وسلم) calls you to that which will give you life, and know that Allah comes in between a person and his heart (i.e. He prevents an evil person to decide anything). And verily to Him you shall (all) be gathered.

source: واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة واعلموا أن الله شديد العقاب
en: And fear the Fitnah (affliction and trial) which affects not in particular (only) those of you who do wrong (but it may afflict all the good and the bad people), and know that Allah is Severe in punishment.

source: واذكروا إذ أنتم قليل مستضعفون في الأرض تخافون أن يتخطفكم الناس فآواكم وأيدكم بنصره ورزقكم من الطيبات لعلكم تشكرون
en: And remember when you were few and were reckoned weak in the land, and were afraid that men might kidnap you, but He provided a safe place for you, strengthened you with His Help, and provided you with good things so that you might be grateful.

source: يا أيها الذين آمنوا لا تخونوا الله والرسول وتخونوا أماناتكم وأنتم تعلمون
en: O you who believe! Betray not Allah and His Messenger, nor betray knowingly your Amanat (things entrusted to you, and all the duties which Allah has ordained for you).

source: واعلموا أنما أموالكم وأولادكم فتنة وأن الله عنده أجر عظيم
en: And know that your possessions and your children are but a trial and that surely with Allah is a mighty reward.

source: يا أيها الذين آمنوا إن تتقوا الله يجعل لكم فرقانا ويكفر عنكم سيئاتكم ويغفر لكم والله ذو الفضل العظيم
en: O you who believe! If you obey and fear Allah, He will grant you Furqan [(a criterion to judge between right and wrong), or (Makhraj, i.e. a way for you to get out from every difficulty)], and will expiate for you your sins, and forgive you; and Allah is the Owner of the Great Bounty.

source: وإذ يمكر بك الذين كفروا ليثبتوك أو يقتلوك أو يخرجوك ويمكرون ويمكر الله والله خير الماكرين
en: And (remember) when the disbelievers plotted against you (O Muhammad صلى الله عليه وسلم) to imprison you, or to kill you, or to get you out (from your home, i.e. Makkah); they were plotting and Allah too was plotting; and Allah is the Best of those who plot.

source: وإذا تتلى عليهم آياتنا قالوا قد سمعنا لو نشاء لقلنا مثل هذا إن هذا إلا أساطير الأولين
en: And when Our Verses (of the Qur'an) are recited to them, they say: "We have heard (the Qur'an); if we wish we can say the like of this. This is nothing but the tales of the ancients."

source: وإذ قالوا اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم
en: And (remember) when they said: "O Allah! If this (the Qur'an) is indeed the truth (revealed) from You, then rain down stones on us from the sky or bring on us a painful torment."

source: وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون
en: And Allah would not punish them while you (Muhammad صلى الله عليه وسلم) are amongst them, nor will He punish them while they seek (Allah's) Forgiveness.

source: وما لهم ألا يعذبهم الله وهم يصدون عن المسجد الحرام وما كانوا أولياءه إن أولياؤه إلا المتقون ولكن أكثرهم لا يعلمون
en: And why should not Allah punish them while they hinder (men) from Al-Masjid-Al-Haram, and they are not its guardians? None can be its guardians except Al-Muttaqun (the pious - See V.2:2), but most of them know not.

source: وما كان صلاتهم عند البيت إلا مكاء وتصدية فذوقوا العذاب بما كنتم تكفرون
en: Their Salat (prayer) at the House (of Allah, i.e. the Ka'bah at Makkah) was nothing but whistling and clapping of hands. Therefore taste the punishment because you used to disbelieve.

source: إن الذين كفروا ينفقون أموالهم ليصدوا عن سبيل الله فسينفقونها ثم تكون عليهم حسرة ثم يغلبون والذين كفروا إلى جهنم يحشرون
en: Verily, those who disbelieve spend their wealth to hinder (men) from the Path of Allah, and so will they continue to spend it; but in the end it will become an anguish for them. Then they will be overcome. And those who disbelieve will be gathered unto Hell.

source: ليميز الله الخبيث من الطيب ويجعل الخبيث بعضه على بعض فيركمه جميعا فيجعله في جهنم أولئك هم الخاسرون
en: In order that Allah may distinguish the wicked (disbelievers, polytheists and doers of evil deeds) from the good (believers of Islamic Monotheism and doers of righteous deeds), and put the wicked (disbelievers, polytheists and doers of evil deeds) one over another, heap them together and cast them into Hell. Those! it is they who are the losers.

source: قل للذين كفروا إن ينتهوا يغفر لهم ما قد سلف وإن يعودوا فقد مضت سنت الأولين
en: Say to those who have disbelieved, if they cease (from disbelief), their past will be forgiven. But if they return (thereto), then the examples of those (punished) before them have already preceded (as a warning).

source: وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله فإن انتهوا فإن الله بما يعملون بصير
en: And fight them until there is no more Fitnah (disbelief and polytheism, i.e. worshipping others besides Allah) and the religion (worship) will all be for Allah Alone [in the whole of the world ]. But if they cease (worshipping others besides Allah), then certainly, Allah is All-Seer of what they do.

source: وإن تولوا فاعلموا أن الله مولاكم نعم المولى ونعم النصير
en: And if they turn away, then know that Allah is your Maula (Patron, Lord, Protector and Supporter) - (what) an Excellent Maula and (what) an Excellent Helper!

source: واعلموا أنما غنمتم من شيء فأن لله خمسه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل إن كنتم آمنتم بالله وما أنزلنا على عبدنا يوم الفرقان يوم التقى الجمعان والله على كل شيء قدير
en: And know that whatever of war-booty that you may gain, verily one-fifth (1/5th) of it is assigned to Allah, and to the Messenger, and to the near relatives [of the Messenger (Muhammad صلى الله عليه وسلم)], (and also) the orphans, Al-Masakin (the poor) and the wayfarer, if you have believed in Allah and in that which We sent down to Our slave (Muhammad صلى الله عليه وسلم) on the Day of criterion (between right and wrong), the Day when the two forces met (the battle of Badr); And Allah is able to do all things.

source: إذ أنتم بالعدوة الدنيا وهم بالعدوة القصوى والركب أسفل منكم ولو تواعدتم لاختلفتم في الميعاد ولكن ليقضي الله أمرا كان مفعولا ليهلك من هلك عن بينة ويحيى من حي عن بينة وإن الله لسميع عليم
en: (And remember) when you (the Muslim army) were on the near side of the valley, and they on the farther side, and the caravan on the ground lower than you. Even if you had made a mutual appointment to meet, you would certainly have failed in the appointment, but (you met) that Allah might accomplish a matter already ordained (in His Knowledge), so that those who were to be destroyed (for their rejecting the Faith) might be destroyed after a clear evidence, and those who were to live (i.e. believers) might live after a clear evidence. And surely, Allah is All-Hearer, All-Knower.

source: إذ يريكهم الله في منامك قليلا ولو أراكهم كثيرا لفشلتم ولتنازعتم في الأمر ولكن الله سلم إنه عليم بذات الصدور
en: (And remember) when Allah showed them to you as few in your (i.e. Muhammad's صلى الله عليه وسلم) dream; if He had shown them to you as many, you would surely have been discouraged, and you would surely have disputed in making a decision. But Allah saved (you). Certainly, He is the All-Knower of what is in the breasts.

source: وإذ يريكموهم إذ التقيتم في أعينكم قليلا ويقللكم في أعينهم ليقضي الله أمرا كان مفعولا وإلى الله ترجع الأمور
en: And (remember) when you met (the army of the disbelievers on the Day of the battle of Badr), He showed them to you as few in your eyes and He made you appear as few in their eyes, so that Allah might accomplish a matter already ordained (in His Knowledge), and to Allah return all matters (for decision).

source: يا أيها الذين آمنوا إذا لقيتم فئة فاثبتوا واذكروا الله كثيرا لعلكم تفلحون
en: O you who believe! When you meet (an enemy) force, take a firm stand against them and remember the Name of Allah much (both with tongue and mind), so that you may be successful.

source: وأطيعوا الله ورسوله ولا تنازعوا فتفشلوا وتذهب ريحكم واصبروا إن الله مع الصابرين
en: And obey Allah and His Messenger, and do not dispute (with one another) lest you lose courage and your strength departs, and be patient. Surely, Allah is with those who are As-Sabirun (the patient).

source: ولا تكونوا كالذين خرجوا من ديارهم بطرا ورئاء الناس ويصدون عن سبيل الله والله بما يعملون محيط
en: And be not like those who come out of their homes boastfully and to be seen of men, and hinder (men) from the Path of Allah; and Allah is Muhitun (encircling and thoroughly comprehending) all that they do.

source: وإذ زين لهم الشيطان أعمالهم وقال لا غالب لكم اليوم من الناس وإني جار لكم فلما تراءت الفئتان نكص على عقبيه وقال إني بريء منكم إني أرى ما لا ترون إني أخاف الله والله شديد العقاب
en: And (remember) when Shaitan (Satan) made their (evil) deeds seem fair to them and said, "No one of mankind can overcome you this Day (of the battle of Badr) and verily, I am your neighbour (for each and every help)." But when the two forces came in sight of each other, he ran away and said "Verily, I have nothing to do with you. Verily! I see what you see not. Verily! I fear Allah for Allah is Severe in punishment."

source: إذ يقول المنافقون والذين في قلوبهم مرض غر هؤلاء دينهم ومن يتوكل على الله فإن الله عزيز حكيم
en: When the hypocrites and those in whose hearts was a disease (of disbelief) said: "These people (Muslims) are deceived by their religion." But whoever puts his trust in Allah, then surely, Allah is All-Mighty, All-Wise.

source: ولو ترى إذ يتوفى الذين كفروا الملائكة يضربون وجوههم وأدبارهم وذوقوا عذاب الحريق
en: And if you could see when the angels take away the souls of those who disbelieve (at death); they smite their faces and their backs, (saying): "Taste the punishment of the blazing Fire."

source: كدأب آل فرعون والذين من قبلهم كفروا بآيات الله فأخذهم الله بذنوبهم إن الله قوي شديد العقاب
en: Similar to the behaviour of the people of Fir'aun (Pharaoh), and of those before them - they rejected the Ayat (proofs, verses, etc.) of Allah, so Allah punished them for their sins. Verily, Allah is All-Strong, Severe in punishment.

source: ذلك بأن الله لم يك مغيرا نعمة أنعمها على قوم حتى يغيروا ما بأنفسهم وأن الله سميع عليم
en: That is so because Allah will never change a grace which He has bestowed on a people until they change what is in their ownselves. And verily, Allah is All-Hearer, All-Knower.

source: كدأب آل فرعون والذين من قبلهم كذبوا بآيات ربهم فأهلكناهم بذنوبهم وأغرقنا آل فرعون وكل كانوا ظالمين
en: Similar to the behaviour of the people of Fir'aun (Pharaoh), and those before them. They belied the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord, so We destroyed them for their sins, and We drowned the people of Fir'aun (Pharaoh) for they were all Zalimun (polytheists and wrong-doers).

source: إن شر الدواب عند الله الذين كفروا فهم لا يؤمنون
en: Verily, The worst of moving (living) creatures before Allah are those who disbelieve , - so they shall not believe.

source: الذين عاهدت منهم ثم ينقضون عهدهم في كل مرة وهم لا يتقون
en: They are those with whom you made a covenant, but they break their covenant every time and they do not fear Allah.

source: فإما تثقفنهم في الحرب فشرد بهم من خلفهم لعلهم يذكرون
en: So if you gain the mastery over them in war, punish them severely in order to disperse those who are behind them, so that they may learn a lesson.

source: وإما تخافن من قوم خيانة فانبذ إليهم على سواء إن الله لا يحب الخائنين
en: If you (O Muhammad صلى الله عليه وسلم) fear treachery from any people throw back (their covenant) to them (so as to be) on equal terms (that there will be no more covenant between you and them). Certainly Allah likes not the treacherous.

source: ولا يحسبن الذين كفروا سبقوا إنهم لا يعجزون
en: And let not those who disbelieve think that they can outstrip (escape from the punishment). Verily, they will never be able to save themselves (from Allah's Punishment).

source: وأعدوا لهم ما استطعتم من قوة ومن رباط الخيل ترهبون به عدو الله وعدوكم وآخرين من دونهم لا تعلمونهم الله يعلمهم وما تنفقوا من شيء في سبيل الله يوف إليكم وأنتم لا تظلمون
en: And make ready against them all you can of power, including steeds of war (tanks, planes, missiles, artillery) to threaten the enemy of Allah and your enemy, and others besides whom, you may not know but whom Allah does know. And whatever you shall spend in the Cause of Allah shall be repaid unto you, and you shall not be treated unjustly.

source: وإن جنحوا للسلم فاجنح لها وتوكل على الله إنه هو السميع العليم
en: But if they incline to peace, you also incline to it, and (put your) trust in Allah. Verily, He is the All-Hearer, the All-Knower.

source: وإن يريدوا أن يخدعوك فإن حسبك الله هو الذي أيدك بنصره وبالمؤمنين
en: And if they intend to deceive you, then verily, Allah is All-Sufficient for you. He it is Who has supported you with His Help and with the believers.

source: وألف بين قلوبهم لو أنفقت ما في الأرض جميعا ما ألفت بين قلوبهم ولكن الله ألف بينهم إنه عزيز حكيم
en: And He has united their (i.e. believers') hearts. If you had spent all that is in the earth, you could not have united their hearts, but Allah has united them. Certainly He is All-Mighty, All-Wise.

source: يا أيها النبي حسبك الله ومن اتبعك من المؤمنين
en: O Prophet (Muhammad صلى الله عليه وسلم)! Allah is Sufficient for you and for the believers who follow you.

source: يا أيها النبي حرض المؤمنين على القتال إن يكن منكم عشرون صابرون يغلبوا مائتين وإن يكن منكم مائة يغلبوا ألفا من الذين كفروا بأنهم قوم لا يفقهون
en: O Prophet (Muhammad صلى الله عليه وسلم)! Urge the believers to fight. If there are twenty steadfast persons amongst you, they will overcome two hundreds, and if there be a hundred steadfast persons they will overcome a thousand of those who disbelieve, because they (the disbelievers) are people who do not understand.

source: الآن خفف الله عنكم وعلم أن فيكم ضعفا فإن يكن منكم مائة صابرة يغلبوا مائتين وإن يكن منكم ألف يغلبوا ألفين بإذن الله والله مع الصابرين
en: Now Allah has lightened your (task), for He knows that there is weakness in you. So if there are of you a hundred steadfast persons, they shall overcome two hundreds, and if there are a thousand of you, they shall overcome two thousand with the Leave of Allah. And Allah is with As-Sabirun (the patient).

source: ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض تريدون عرض الدنيا والله يريد الآخرة والله عزيز حكيم
en: It is not for a Prophet that he should have prisoners of war (and free them with ransom) until he had made a great slaughter (among his enemies) in the land. You desire the good of this world (i.e. the money of ransom for freeing the captives), but Allah desires (for you) the Hereafter. And Allah is All-Mighty, All-Wise.

source: لولا كتاب من الله سبق لمسكم فيما أخذتم عذاب عظيم
en: Were it not a previous ordainment from Allah, a severe torment would have touched you for what you took.

source: فكلوا مما غنمتم حلالا طيبا واتقوا الله إن الله غفور رحيم
en: So enjoy what you have gotten of booty in war, lawful and good, and be afraid of Allah. Certainly, Allah is Oft-Forgiving, Most Merciful.

source: يا أيها النبي قل لمن في أيديكم من الأسرى إن يعلم الله في قلوبكم خيرا يؤتكم خيرا مما أخذ منكم ويغفر لكم والله غفور رحيم
en: O Prophet (Muhammad صلى الله عليه وسلم) Say to the captives that are in your hands! "If Allah knows any good in your hearts, He will give you something better than what has been taken from you, and He will forgive you, and Allah is Oft-Forgiving, Most Merciful."

source: وإن يريدوا خيانتك فقد خانوا الله من قبل فأمكن منهم والله عليم حكيم
en: But if they intend to betray you (O Muhammad صلى الله عليه وسلم), they indeed betrayed Allah before. So He gave (you) power over them. And Allah is All-Knower, All-Wise.

source: إن الذين آمنوا وهاجروا وجاهدوا بأموالهم وأنفسهم في سبيل الله والذين آووا ونصروا أولئك بعضهم أولياء بعض والذين آمنوا ولم يهاجروا ما لكم من ولايتهم من شيء حتى يهاجروا وإن استنصروكم في الدين فعليكم النصر إلا على قوم بينكم وبينهم ميثاق والله بما تعملون بصير
en: Verily, those who believed, and emigrated and strove hard and fought with their property and their lives in the Cause of Allah as well as those who gave (them) asylum and help, - these are (all) allies to one another. And as to those who believed but did not emigrate (to you O Muhammad صلى الله عليه وسلم), you owe no duty of protection to them until they emigrate ; but if they seek your help in religion, it is your duty to help them except against a people with whom you have a treaty of mutual alliance; and Allah is the All-Seer of what you do.

source: والذين كفروا بعضهم أولياء بعض إلا تفعلوه تكن فتنة في الأرض وفساد كبير
en: And those who disbelieve are allies of one another, (and) if you (Muslims of the whole world collectively) do not do so [i.e. become allies, as one united block under one Khalifah (a chief Muslim ruler for the whole Muslim world) to make victorious Allah's religion of Islamic Monotheism], there will be Fitnah (wars, battles, polytheism) and oppression on the earth, and a great mischief and corruption (appearance of polytheism).

source: والذين آمنوا وهاجروا وجاهدوا في سبيل الله والذين آووا ونصروا أولئك هم المؤمنون حقا لهم مغفرة ورزق كريم
en: And those who believed, and emigrated and strove hard in the Cause of Allah (Al-Jihad), as well as those who gave (them) asylum and aid - these are the believers in truth, for them is forgiveness and Rizqun Karim (a generous provision i.e. Paradise).

source: والذين آمنوا من بعد وهاجروا وجاهدوا معكم فأولئك منكم وأولو الأرحام بعضهم أولى ببعض في كتاب الله إن الله بكل شيء عليم
en: And those who believed afterwards, and emigrated and strove hard along with you (in the Cause of Allah), they are of you. But kindred by blood are nearer to one another (regarding inheritance) in the decree ordained by Allah. Verily, Allah is the All-Knower of everything.

source: براءة من الله ورسوله إلى الذين عاهدتم من المشركين
en: Freedom from (all) obligations (is declared) from Allah and His Messenger (صلى الله عليه وسلم) to those of the Mushrikun (polytheists, pagans, idolaters, disbelievers in the Oneness of Allah), with whom you made a treaty.

source: فسيحوا في الأرض أربعة أشهر واعلموا أنكم غير معجزي الله وأن الله مخزي الكافرين
en: So travel freely (O Mushrikun - See V.2:105) for four months (as you will) throughout the land, but know that you cannot escape (from the punishment of) Allah; and Allah will disgrace the disbelievers.

source: وأذان من الله ورسوله إلى الناس يوم الحج الأكبر أن الله بريء من المشركين ورسوله فإن تبتم فهو خير لكم وإن توليتم فاعلموا أنكم غير معجزي الله وبشر الذين كفروا بعذاب أليم
en: And a declaration from Allah and His Messenger to mankind on the greatest day (the 10th of Dhul-Hijjah - the 12th month of Islamic calendar) that Allah is free from (all) obligations to the Mushrikun (See V.2:105) and so is His Messenger. So if you (Mushrikun ) repent, it is better for you, but if you turn away, then know that you cannot escape (from the Punishment of) Allah. And give tidings (O Muhammad صلى الله عليه وسلم) of a painful torment to those who disbelieve.

source: إلا الذين عاهدتم من المشركين ثم لم ينقصوكم شيئا ولم يظاهروا عليكم أحدا فأتموا إليهم عهدهم إلى مدتهم إن الله يحب المتقين
en: Except those of the Mushrikun (see V.2:105) with whom you have a treaty, and who have not subsequently failed you in aught, nor have supported anyone against you. So fulfil their treaty to them for the end of their term. Surely Allah loves Al-Mattaqun (the pious - See V.2:2).

source: فإذا انسلخ الأشهر الحرم فاقتلوا المشركين حيث وجدتموهم وخذوهم واحصروهم واقعدوا لهم كل مرصد فإن تابوا وأقاموا الصلاة وآتوا الزكاة فخلوا سبيلهم إن الله غفور رحيم
en: Then when the Sacred Months (the 1st, 7th, 11th, and 12th months of the Islamic calendar) have passed, then kill the Mushrikun (See V.2:105) wherever you find them, and capture them and besiege them, and lie in wait for them in each and every ambush. But if they repent and perform As-Salat (Iqamat-as-Salat), and give Zakat, then leave their way free. Verily, Allah is Oft-Forgiving, Most Merciful.

source: وإن أحد من المشركين استجارك فأجره حتى يسمع كلام الله ثم أبلغه مأمنه ذلك بأنهم قوم لا يعلمون
en: And if anyone of the Mushrikun (polytheists, idolaters, pagans, disbelievers in the Oneness of Allah) seeks your protection, then grant him protection so that he may hear the Word of Allah (the Qur'an), and then escort him to where he can be secure, that is because they are men who know not.

source: كيف يكون للمشركين عهد عند الله وعند رسوله إلا الذين عاهدتم عند المسجد الحرام فما استقاموا لكم فاستقيموا لهم إن الله يحب المتقين
en: How can there be a covenant with Allah and with His Messenger for the Mushrikun (polytheists, idolaters, pagans, disbelievers in the Oneness of Allah) except those with whom you made a covenant near Al-Masjid-al-Haram (at Makkah)? So long as they are true to you, stand you true to them. Verily, Allah loves Al-Muttaqun (the pious - See V.2:2).

source: كيف وإن يظهروا عليكم لا يرقبوا فيكم إلا ولا ذمة يرضونكم بأفواههم وتأبى قلوبهم وأكثرهم فاسقون
en: How (can there be such a covenant with them) that when you are overpowered by them, they regard not the ties, either of kinship or of covenant with you? With (good words from) their mouths they please you, but their hearts are averse to you, and most of them are Fasiqun (rebellious, disobedient to Allah).

source: اشتروا بآيات الله ثمنا قليلا فصدوا عن سبيله إنهم ساء ما كانوا يعملون
en: They have purchased with the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah a little gain, and they hindered men from His Way; evil indeed is that which they used to do.

source: لا يرقبون في مؤمن إلا ولا ذمة وأولئك هم المعتدون
en: With regard to a believer, they respect not the ties, either of kinship or of covenant! It is they who are the transgressors.

source: فإن تابوا وأقاموا الصلاة وآتوا الزكاة فإخوانكم في الدين ونفصل الآيات لقوم يعلمون
en: But if they repent, perform As-Salat, (Iqamat-as-Salat) and give Zakat, then they are your brethren in religion. (In this way) We explain the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) in detail for a people who know.

source: وإن نكثوا أيمانهم من بعد عهدهم وطعنوا في دينكم فقاتلوا أئمة الكفر إنهم لا أيمان لهم لعلهم ينتهون
en: But if they violate their oaths after their covenant, and attack your religion with disapproval and criticism, then fight (you) the leaders of disbelief (chiefs of Quraish pagans of Makkah) - for surely their oaths are nothing to them - so that they may stop (evil actions).

source: ألا تقاتلون قوما نكثوا أيمانهم وهموا بإخراج الرسول وهم بدءوكم أول مرة أتخشونهم فالله أحق أن تخشوه إن كنتم مؤمنين
en: Will you not fight a people who have violated their oaths (pagans of Makkah), and intended to expel the Messenger while they did attack you first? Do you fear them? Allah has more right that you should fear Him if you are believers.

source: قاتلوهم يعذبهم الله بأيديكم ويخزهم وينصركم عليهم ويشف صدور قوم مؤمنين
en: Fight against them so that Allah will punish them by your hands and disgrace them and give you victory over them and heal the breasts of a believing people,

source: ويذهب غيظ قلوبهم ويتوب الله على من يشاء والله عليم حكيم
en: And remove the anger of their (believers') hearts. Allah accepts the repentance of whom He wills. Allah is All-Knowing, All-Wise.
